#include <stdio.h>
#include "iodefine.h"
#include "lsen.h"

//-----------------------------------------------------------------------------
//  概　要：初期化
//  引  数：なし
//  戻り値：なし
//-----------------------------------------------------------------------------
void Lsen_init(void)
{
	//	AD制御レジスタ初期化
	AD.ADCSR.BYTE	= 0x00;		//	ADIE:0	割り込み禁止
								//	ADST:0	AD変換停止
								//	SCAN:0	単一モード
								//	CKS :0	137ステート
}

//-----------------------------------------------------------------------------
//  概　要：光センサーのAD値取得
//  引  数：sen1	センサー1に関するAD値(0-1023)
//			sen2	センサー2に関するAD値(0-1023)
//  戻り値：0	正常
//			-1	異常
//-----------------------------------------------------------------------------
int Lsen_getSensor(unsigned short * sen1, unsigned short * sen2)
{
	if (sen1 == NULL || sen2 == NULL)
	{
		return -1;
	}

	//-----------------------------------------
	//	光センサー1のAD変換処理
	//-----------------------------------------
	AD.ADCSR.BIT.CH		= 0;	//	変換チャネル指定
	AD.ADCSR.BIT.ADST	= 1;	//	AD変換開始

	//	AD変換完了待ち
	while (AD.ADCSR.BIT.ADF == 0);

	AD.ADCSR.BIT.ADF = 0;		//	完了フラグクリア
	*sen1 = AD.ADDRA >> 6;		//	AD値取得

	//-----------------------------------------
	//	光センサー1のAD変換処理
	//-----------------------------------------
	AD.ADCSR.BIT.CH		= 1;	//	変換チャネル指定
	AD.ADCSR.BIT.ADST	= 1;	//	AD変換開始

	//	AD変換完了待ち
	while (AD.ADCSR.BIT.ADF == 0);

	AD.ADCSR.BIT.ADF = 0;		//	完了フラグクリア
	*sen2= AD.ADDRB >> 6;		//	AD値取得

	return 0;
}