#include "iodefine.h"
#include "spk.h"

//--------------------------------------------------------------------
//	グローバル変数
//--------------------------------------------------------------------
//	音階のタイマカウンタ値(128分周時)
const static gScaleTable[] =
{
	179,	//	ド
	160,	//	レ
	142,	//	ミ
	134,	//	ファ
	120,	//	ソ
	107,	//	ラ
	95,		//	シ
	90,		//	ド
};

//-----------------------------------------------------------------------------
//  概　要：初期化
//  引  数：なし
//  戻り値：なし
//-----------------------------------------------------------------------------
void Spk_init(void)
{
	TV.TCRV1.BIT.ICKS	= 1;	//	128分周設定予定
	TV.TCRV0.BIT.CKS	= 0;	//	タイマカウント停止
	TV.TCRV0.BIT.CCLR	= 1;	//	コンペマッチAでカウンタクリア
	
	TV.TCSRV.BIT.OS		= 9;	//	出力形式	コンペアマッチBでポートHigh
								//				コンペアマッチAでポートLow
}

//-----------------------------------------------------------------------------
//  概　要：音の出力開始
//  引  数：scale	音階の指定
//  戻り値：0	正常
//			-1	異常
//-----------------------------------------------------------------------------
int Spk_start(E_SPK_SCALE scale)
{
	//	指定音階の範囲異常チェック
	if (scale < 0 || scale >= E_SPK_SCALE_END)
	{
		return -1;
	}

	//	デューティ比50%のクロック生成;
	TV.TCORA	= gScaleTable[scale];
	TV.TCORB	= TV.TCORA / 2;

	//	128分周でタイマカウント開始
	TV.TCRV0.BIT.CKS	= 3;			//	128分周
	
	return 0;
}

//-----------------------------------------------------------------------------
//  概　要：音の出力停止
//  引  数：なし
//  戻り値：0	正常
//			-1	異常
//-----------------------------------------------------------------------------
int Spk_stop(void)
{
	TV.TCRV0.BIT.CKS	= 0;	//	タイマカウント停止
	TV.TCNTV			= 0;	//	タイマカウント値の初期化
	
	return 0;
}