#include "iodefine.h"
#include "sw.h"

//-----------------------------------------------------------------------------
//  概　要：初期化
//  引  数：なし
//  戻り値：なし
//-----------------------------------------------------------------------------
void Sw_init(void)
{
	
}

//-----------------------------------------------------------------------------
//  概　要：スイッチ状態の取得
//  引  数：なし
//  戻り値：D_SW_STATE_OFF	押されていない
//			D_SW_STATE_ON	押されている
//-----------------------------------------------------------------------------
int Sw_getPressed(void)
{
	if (IO.PDR7.BIT.B4 == 0)		//	電圧Lowの時にスイッチON
	{
		return D_SW_PRESSED_ON;		//	スイッチが押されている
	}
	else
	{
		return D_SW_PRESSED_OFF;	//	スイッチが押されていない
	}
}